<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Αρχική Σελίδα</title>
    <link rel="stylesheet" href="style.css">
</head>

<body>
    <div class="header">
        <h1>Αρχική Σελίδα</h1>
    </div>
    <div class="container">
        <div class="menu">
            <a href="studentPage.php">Αρχική Σελίδα</a>
            <a href="announcement.php">Ανακοινώσεις</a>
            <a href="communication.php">Επικοινωνία</a>
            <a href="documents.php">Έγγραφα Μαθήματος</a>
            <a href="homework.php">Εργασίες</a>
        </div>
        <div class="content">
            <h2>Καλωσήρθατε στο μάθημα Δομές Δεδομένων </h2>
            <p>Το μάθημα των Δομών Δεδομένων διδάσκεται στο 2ο εξάμηνο σπουδών του Προπτυχιακού Προγράμματος Σπουδών του Τμήματος Πληροφορικής. Σκοπός του μαθήματος είναι η μελέτη μεθόδων οργάνωσης των δεδομένων, με στόχο την αποτελεσματική και αποδοτική
                επεξεργασία τους. Στο μάθημα αυτό, θα εστιάσουμε σε δομές κύριας μνήμης, κάνοντας την υπόθεση ότι τα δεδομένα μας μπορούν να χωρέσουν στην κύρια μνήμη. Σε μαθήματα ανώτερων εξαμήνων θα διδαχθείτε τεχνικές οργάνωσης που μπορούν να χρησιμοποιηθούν
                όταν αναγκαστικά πρέπει να χρησιμοποιήσουμε δευτερεύουσα μνήμη.</p>
            <p>Η διδασκαλία του μαθήματος περιλαμβάνει συνοπτικά:</p>
            <ul>
                <li>οργάνωση δεδομένων με πίνακες</li>
                <li>αναζήτηση δεδομένων σε ταξινομημένο πίνακα</li>
                <li>γραμμικές και συνδεδεμένες λίστες</li>
                <li>ουρές και στοίβες</li>
                <li>ουρές προτεραιότητας (priority queues)</li>
                <li>δένδρα αναζήτησης</li>
                <li>ισοζυγισμένα δένδρα αναζήτησης</li>
                <li>μέθοδοι διάσχισης δένδρων</li>
                <li>αλγόριθμοι ταξινόμησης πινάκων</li>
                <li>μέθοδοι κατακερματισμού (hashing) και μελέτη επίδοσης</li>
                <li>δομές γράφων (graphs) και μέθοδοι αναζήτησης (π.χ., συντομότερα μονοπάτια)</li>
            </ul>
            <div class="center-image">
                <img src="https://www.newmoney.gr/wp-content/uploads/2023/12/sw2-1280x722.jpg" alt="Παράδειγμα εικόνας" style="width: 600px; height: 300px; margin-top: 40px;">
            </div>
            
            <a href="#top" class="top-link">Επιστροφή στην κορυφή</a>
        </div>
    </div>
</body>

</html>